app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 4], ["id", 3], ["LIMIT", 1]]
---
  def show
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      @song = artist.songs.find_by(id: params[:id])