app/controllers/songs_controller.rb

  def index
  #  @songs = Song.all
    if params[:artist_id]
   # input =(
     # if (Integer(params[:artist_id]) rescue nil)
       if !(@songs = Artist.find(params[:artist_id]).songs rescue nil)
         flash[:alert]="Artist not found."
         redirect_to artists_path
      end
   else
     @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "artists"."id" FROM "artists"
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find(params[:id]) rescue nil
    if !@song && params[:artist_id]
        @artist=Artist.find(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]